doc/notes_use-cases.org
* Register

Initiator: Anonymous

Goal: Create new user

Main Success Scenario:

   1. Anonymous gets to sign in page
   2. Anonymous enters credentials (name, email, password)
   5. System checks credentials for correctness
   6. System creates new user
   7. System logs in new user
   8. Anonymous role is changed to "researcher"

Extensions:
   5. Anonymous does not enter all the data
      1. System asks user to enter all the data
      2. Anonymous enters all the data
   5. Email already in use
      1. System asks user to enter another email
      2. Anonymous enters another email
   5. Password does not meet security requirements 
      1. System asks user to enter another password
      2. Anonymous enters another password

* Login

Initiator: Anonymous

Goal: Log in

Main Success Scenario:

   1. Anonymous gets to log in page
   2. Anonymous enters credentials (email, password)
   3. System checks credentials for correctness
   4. System creates new user
   5. System logs in new user
   6. Anonymous role is changed to "researcher"

Extensions:
   3. Anonymous does not enter all the data
      1. System asks user to enter all the data
      2. Anonymous enters all the data
   3. Email and password combination is not known to the system
      1. System asks user to enter another email and password
      2. Anonymous enters another email and password

* Logout

Initiator: Researcher

Goal: Log out

Main Success Scenario:

   1. Researcher asks system to log him out
   2. System terminates connection with user
   3. Researcher changes his role to Anonymous

* Create appointment

Initiator: Researcher

Goal: Create new appointment

Main Success Scenario:

   1. Researcher asks system to create new appointment
   2. Researcher selects appointment type
   3. Include Enter type specific appointment information
   4. Include Enter generic appointment information
   5. Researcher is shown conflicts with his schedule (OPT)
   6. Researches acknowledges appointment creation
   7. System creates the appointment
   8. System assigns researcher as the creator for newly created appointment
   9. Researcher is shown conflicts with all other schedules (OPT)


Extensions:

   6. Researcher decides to avoid conflicts
      1. Researcher changes appointment time
      2. Goto 5.

* Enter type-specific appointment information

Initiator: Included only

Goal: Get type specific information

Main success scenario:

   1. System creates form with type-specific data field
   2. Researcher enters data

Extensions:

   1. Appointment type is "Project group meeting"
      1. Create field for group selection
      2. Include Create time field

   1. Appointment type is "Research group meeting"
      1. Create field for group selection
      2. Include Create time field

   1. Appointment type is "Teaching appointment"
      1. Create field for group selection
      2. Include Create time field

   1. Appointment type is "Conference appointment"
      1. Create field for group selection
      2. Include Create time field

* Create time field

Initiator: Included only

Goal: Create time field for requesting date/time information

Main success scenario:

   1. Researcher tells when appointment takes place
   2. Researcher tells that appointment is regular
   3. Researcher tells period within which appointment takes place
   4. Researcher tells time range in which appointment takes place

Extensions:

   2. Researcher tells that appointment is one-shot
      1. Done

* Enter generic appointment information

Initiator: Included only

Goal: Get type generic information

Main success scenario:

   1. Researchers enters location
   2. Researchers enters description

* Delete appointment

Initiator: Appointment creator

Goal: Delete appointment from all schedules

Main success scenario:

   1. Creator finds appointment in his schedule
   2. Creator asks system to delete appointment
   3. System asks for acknowledgment
   4. Creator acknowledges
   5. System deletes appointments from all schedules

Initiator: Appointment participant

Goal: Delete appointment from personal schedule

Main success scenario:

   1. Creator finds appointment in his schedule
   2. Creator asks system to delete appointment
   3. System asks for acknowledgment
   4. Creator acknowledges
   5. System deletes appointments from creator's schedule

* Invite participant

Initiator: Appointment participant

Goal: Invite other participant to appointment

Main success scenario:

   1. Participant finds appointment in his schedule
   2. Participant asks system to invite another participant
   3. System asks for another participant information
   4. Participant enters another participant information (email, other inf is OPT)
   5. System shows list of found participants
   6. Participant chooses one or more (OPT) other participants
   7. System asks for acknowledgment
   8. Participant acknowledges
   9. System invites chosen participants to chosen appointment

Extensions:

   5. System does not find any participant that matches entered information
      1. Participant enters another information
      2. System makes another search

* Create group

Initiator: Participant

Goal: Create project or research group

Main success scenario:

   1. Participant chooses group name and type
   2. System checks that group with specified name and is possible to create
   3. System creates group
   4. System generates group password
   5. System assign participant as a group creator
   6. System shows password to group creator

Extensions:

   2. Group name of such type already in use
      1. System asks participant to enter another name and type
      2. Participant enters another name and type
     

* Join group

Initiator: Participant

Goal: Join new project or research group

Main success scenario:

   1. Participant enters group name, type and password
   2. System checks name, type and password
   3. System assign participant to new group

Extensions:

   1. System does not find matching name, group and password
      1. Participant is told that no match has been found
      2. Participant enters another name, group and password
   2. User already takes part in research group
      1. Deny joining another research group

* Leave group


Initiator: Participant

Goal: Leave group

Main success scenario:

   1. Participant enters group name and type
   2. System removes user from the group

* Delete group

Impossible?

* Change Group password

Impossible
