doc/notes_use-cases.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>notes<sub>use</sub>-cases</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="notes<sub>use</sub>-cases"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-05-19T11:18+0200"/>
<meta name="author" content="Maksym Planeta"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">notes<sub>use</sub>-cases</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Register</a></li>
<li><a href="#sec-2">2 Login</a></li>
<li><a href="#sec-3">3 Logout</a></li>
<li><a href="#sec-4">4 Create appointment</a></li>
<li><a href="#sec-5">5 Enter type-specific appointment information</a></li>
<li><a href="#sec-6">6 Create time field</a></li>
<li><a href="#sec-7">7 Enter generic appointment information</a></li>
<li><a href="#sec-8">8 Delete appointment</a></li>
<li><a href="#sec-9">9 Invite participant</a></li>
<li><a href="#sec-10">10 Create group</a></li>
<li><a href="#sec-11">11 Join group</a></li>
<li><a href="#sec-12">12 Leave group</a></li>
<li><a href="#sec-13">13 Delete group</a></li>
<li><a href="#sec-14">14 Change Group password</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Register</h2>
<div class="outline-text-2" id="text-1">


<p>
Initiator: Anonymous
</p>
<p>
Goal: Create new user
</p>
<p>
Main Success Scenario:
</p>
<ol>
<li>Anonymous gets to sign in page
</li>
<li>Anonymous enters credentials (name, email, password)
</li>
<li>System checks credentials for correctness
</li>
<li>System creates new user
</li>
<li>System logs in new user
</li>
<li>Anonymous role is changed to "researcher"
</li>
</ol>


<p>
Extensions:
</p><ol>
<li>Anonymous does not enter all the data
<ol>
<li>System asks user to enter all the data
</li>
<li>Anonymous enters all the data
</li>
</ol>

</li>
<li>Email already in use
<ol>
<li>System asks user to enter another email
</li>
<li>Anonymous enters another email
</li>
</ol>

</li>
<li>Password does not meet security requirements 
<ol>
<li>System asks user to enter another password
</li>
<li>Anonymous enters another password
</li>
</ol>

</li>
</ol>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Login</h2>
<div class="outline-text-2" id="text-2">


<p>
Initiator: Anonymous
</p>
<p>
Goal: Log in
</p>
<p>
Main Success Scenario:
</p>
<ol>
<li>Anonymous gets to log in page
</li>
<li>Anonymous enters credentials (email, password)
</li>
<li>System checks credentials for correctness
</li>
<li>System creates new user
</li>
<li>System logs in new user
</li>
<li>Anonymous role is changed to "researcher"
</li>
</ol>


<p>
Extensions:
</p><ol>
<li>Anonymous does not enter all the data
<ol>
<li>System asks user to enter all the data
</li>
<li>Anonymous enters all the data
</li>
</ol>

</li>
<li>Email and password combination is not known to the system
<ol>
<li>System asks user to enter another email and password
</li>
<li>Anonymous enters another email and password
</li>
</ol>

</li>
</ol>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Logout</h2>
<div class="outline-text-2" id="text-3">


<p>
Initiator: Researcher
</p>
<p>
Goal: Log out
</p>
<p>
Main Success Scenario:
</p>
<ol>
<li>Researcher asks system to log him out
</li>
<li>System terminates connection with user
</li>
<li>Researcher changes his role to Anonymous
</li>
</ol>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Create appointment</h2>
<div class="outline-text-2" id="text-4">


<p>
Initiator: Researcher
</p>
<p>
Goal: Create new appointment
</p>
<p>
Main Success Scenario:
</p>
<ol>
<li>Researcher asks system to create new appointment
</li>
<li>Researcher selects appointment type
</li>
<li>Include Enter type specific appointment information
</li>
<li>Include Enter generic appointment information
</li>
<li>Researcher is shown conflicts with his schedule (OPT)
</li>
<li>Researches acknowledges appointment creation
</li>
<li>System creates the appointment
</li>
<li>System assigns researcher as the creator for newly created appointment
</li>
<li>Researcher is shown conflicts with all other schedules (OPT)
</li>
</ol>



<p>
Extensions:
</p>
<ol>
<li>Researcher decides to avoid conflicts
<ol>
<li>Researcher changes appointment time
</li>
<li>Goto 5.
</li>
</ol>

</li>
</ol>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Enter type-specific appointment information</h2>
<div class="outline-text-2" id="text-5">


<p>
Initiator: Included only
</p>
<p>
Goal: Get type specific information
</p>
<p>
Main success scenario:
</p>
<ol>
<li>System creates form with type-specific data field
</li>
<li>Researcher enters data
</li>
</ol>


<p>
Extensions:
</p>
<ol>
<li>Appointment type is "Project group meeting"
<ol>
<li>Create field for group selection
</li>
<li>Include Create time field

</li>
</ol>

</li>
<li>Appointment type is "Research group meeting"
<ol>
<li>Create field for group selection
</li>
<li>Include Create time field

</li>
</ol>

</li>
<li>Appointment type is "Teaching appointment"
<ol>
<li>Create field for group selection
</li>
<li>Include Create time field

</li>
</ol>

</li>
<li>Appointment type is "Conference appointment"
<ol>
<li>Create field for group selection
</li>
<li>Include Create time field
</li>
</ol>

</li>
</ol>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Create time field</h2>
<div class="outline-text-2" id="text-6">


<p>
Initiator: Included only
</p>
<p>
Goal: Create time field for requesting date/time information
</p>
<p>
Main success scenario:
</p>
<ol>
<li>Researcher tells when appointment takes place
</li>
<li>Researcher tells that appointment is regular
</li>
<li>Researcher tells period within which appointment takes place
</li>
<li>Researcher tells time range in which appointment takes place
</li>
</ol>


<p>
Extensions:
</p>
<ol>
<li>Researcher tells that appointment is one-shot
<ol>
<li>Done
</li>
</ol>

</li>
</ol>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Enter generic appointment information</h2>
<div class="outline-text-2" id="text-7">


<p>
Initiator: Included only
</p>
<p>
Goal: Get type generic information
</p>
<p>
Main success scenario:
</p>
<ol>
<li>Researchers enters location
</li>
<li>Researchers enters description
</li>
</ol>


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Delete appointment</h2>
<div class="outline-text-2" id="text-8">


<p>
Initiator: Appointment creator
</p>
<p>
Goal: Delete appointment from all schedules
</p>
<p>
Main success scenario:
</p>
<ol>
<li>Creator finds appointment in his schedule
</li>
<li>Creator asks system to delete appointment
</li>
<li>System asks for acknowledgment
</li>
<li>Creator acknowledges
</li>
<li>System deletes appointments from all schedules
</li>
</ol>


<p>
Initiator: Appointment participant
</p>
<p>
Goal: Delete appointment from personal schedule
</p>
<p>
Main success scenario:
</p>
<ol>
<li>Creator finds appointment in his schedule
</li>
<li>Creator asks system to delete appointment
</li>
<li>System asks for acknowledgment
</li>
<li>Creator acknowledges
</li>
<li>System deletes appointments from creator's schedule
</li>
</ol>


</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Invite participant</h2>
<div class="outline-text-2" id="text-9">


<p>
Initiator: Appointment participant
</p>
<p>
Goal: Invite other participant to appointment
</p>
<p>
Main success scenario:
</p>
<ol>
<li>Participant finds appointment in his schedule
</li>
<li>Participant asks system to invite another participant
</li>
<li>System asks for another participant information
</li>
<li>Participant enters another participant information (email, other inf is OPT)
</li>
<li>System shows list of found participants
</li>
<li>Participant chooses one or more (OPT) other participants
</li>
<li>System asks for acknowledgment
</li>
<li>Participant acknowledges
</li>
<li>System invites chosen participants to chosen appointment
</li>
</ol>


<p>
Extensions:
</p>
<ol>
<li>System does not find any participant that matches entered information
<ol>
<li>Participant enters another information
</li>
<li>System makes another search
</li>
</ol>

</li>
</ol>


</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Create group</h2>
<div class="outline-text-2" id="text-10">


<p>
Initiator: Participant
</p>
<p>
Goal: Create project or research group
</p>
<p>
Main success scenario:
</p>
<ol>
<li>Participant chooses group name and type
</li>
<li>System checks that group with specified name and is possible to create
</li>
<li>System creates group
</li>
<li>System generates group password
</li>
<li>System assign participant as a group creator
</li>
<li>System shows password to group creator
</li>
</ol>


<p>
Extensions:
</p>
<ol>
<li>Group name of such type already in use
<ol>
<li>System asks participant to enter another name and type
</li>
<li>Participant enters another name and type
</li>
</ol>

</li>
<li>Password does not meet security requirements
</li>
</ol>


</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Join group</h2>
<div class="outline-text-2" id="text-11">


<p>
Initiator: Participant
</p>
<p>
Goal: Join new project or research group
</p>
<p>
Main success scenario:
</p>
<ol>
<li>Participant enters group name, type and password
</li>
<li>System checks name, type and password
</li>
<li>System assign participant to new group
</li>
</ol>


<p>
Extensions:
</p>
<ol>
<li>System does not find matching name, group and password
<ol>
<li>Participant is told that no match has been found
</li>
<li>Participant enters another name, group and password
</li>
</ol>

</li>
<li>User already takes part in research group
<ol>
<li>Deny joining another research group
</li>
</ol>

</li>
</ol>


</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Leave group</h2>
<div class="outline-text-2" id="text-12">



<p>
Initiator: Participant
</p>
<p>
Goal: Leave group
</p>
<p>
Main success scenario:
</p>
<ol>
<li>Participant enters group name and type
</li>
<li>System removes user from the group
</li>
</ol>


</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Delete group</h2>
<div class="outline-text-2" id="text-13">


<p>
Impossible?
</p>
</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Change Group password</h2>
<div class="outline-text-2" id="text-14">


<p>
Impossible
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-05-19T11:18+0200</p>
<p class="author">Author: Maksym Planeta</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.2 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
